Tekla Open API Reference for Tekla Structures 2025
PickInput Class
 The PickInput class handles the input of picked objects and positions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.UI.PickInput
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PickInput : ICollection,
	IEnumerable
<SerializableAttribute>
Public NotInheritable Class PickInput
	Implements ICollection, IEnumerable
The PickInput type exposes the following members.
Properties
Name | Description
Count
 Gets the number of elements contained in the ICollection.
IsSynchronized
 Gets a value indicating whether access to the ICollection is synchronized (thread safe).
SyncRoot
 Gets an object that can be used to synchronize access to the ICollection.
Top
Methods
Name | Description
CopyTo
 Copies the elements of the ICollection to an Array, starting at a particular Array index.
GetEnumerator
 Returns an enumerator that iterates through a collection.
Top
Examples
 The following example asks the user to pick a face and then shows the input for the plug-in:
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
using TSG = Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Windows.Forms;
public class Example
{
    public void Example1()
    {
        Picker Picker = new Picker();
        try
        {
            PickInput Input = Picker.PickFace("");
            IEnumerator MyEnum = Input.GetEnumerator();
            while (MyEnum.MoveNext())
            {
                InputItem Item = MyEnum.Current as InputItem;
                if (Item.GetInputType() == InputItem.InputTypeEnum.INPUT_1_OBJECT)
                {
                    ModelObject M = Item.GetData() as ModelObject;
                    MessageBox.Show(M.Identifier.ToString());
                }
                if (Item.GetInputType() == InputItem.InputTypeEnum.INPUT_POLYGON)
                {
                    ArrayList Points = Item.GetData() as ArrayList;
                    MessageBox.Show((Points[0] as TSG.Point).ToString());
                }
            }
        }
        catch (Exception e)
        {
            MessageBox.Show(e.ToString());
        }
    }
}
See Also
Reference
Tekla.Structures.Model.UI Namespace